Revit 2027 API
DimensionEqualityLabelFormatting.SetFormatOptions Method
 Sets the format options used to show the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetFormatOptions(
	FormatOptions formatOptions
)
Public Sub SetFormatOptions (
	formatOptions As FormatOptions
)
public:
void SetFormatOptions(
	FormatOptions^ formatOptions
)
member SetFormatOptions :
        formatOptions : FormatOptions -> unit
Parameters
formatOptions FormatOptions
 The format options to be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This DimensionEqualityLabelFormatting uses a LabelType which does not support assignment of FormatOptions.
See Also
Reference
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace